dannyf00/Another-Arduino-Clone/pic32duino.h
#ifndef _PIC32DUINO_H
#define _PIC32DUINO_H

//PIC32duino code
// - using PIC32MX1xx/2xx
// - free running core timer for ticks()
// - 
// - version history
// - v2, 5/13/2021: original port
// - 
//
//              |=====================|
//              |                     |
//              |                     |
//              |                     |
//              |                     |
//              |                     |
//              |                     |
//              |                     |
//              |                     |
//              |                     |
//              |                     |
//              |                     |
//              |                     |
//              |                     |
//              |                     |
//              |                     |
//              |                     |
//              |                     |
//              |                     |
//              |                     |
//              |=====================|
//
//
//

#include <xc.h>								//we use xc32
#include <sys/attribs.h>					//attributes for interrupts
#include <stdint.h>							//we use uint types

//hardware configuration
#define PWM_PR				0xffff			//pwm period

//uart1 pin configuration
#define U1TX2RP()			PPS_U1TX_TO_RPB3()			//map u1tx pin to an rp pin: A0, B3, B4, B15, B7, C7, C0, C5
#define U1RX2RP()			PPS_U1RX_TO_RPA2()			//map u1rx pin to an rp pin: A2, B6, A4, B13, B2, C6, C1, C3

//uart2 pin configuration
#define U2TX2RP()			PPS_U2TX_TO_RPB0()			//u2tx pin: A3, B14, B0, B10, B9, C9, C2, C4
#define U2RX2RP()			PPS_U2RX_TO_RPA1()			//u2rx pin: A1, B5, B1, B11, B8, A8, C8, A9

//pwm/oc pin configuration
#define PWM12RP()			PPS_OC1_TO_RPB7()			//oc1 pin: A0, B3, B4, B15, B7, C7, C0, C5
#define PWM22RP()			PPS_OC2_TO_RPB8()			//oc2 pin: A1, B5, B1, B11, B8, A8, C8, A9
#define PWM32RP()			PPS_OC3_TO_RPB9()			//oc3 pin: A3, B14, B0, B10, B9, C9, C2, C4
#define PWM42RP()			PPS_OC4_TO_RPA2()			//oc4 pin: A2, B6, A4, B13, B2, C6, C1, C3
#define PWM52RP()			PPS_OC5_TO_RPA4()			//oc5 pin: A2, B6, A4, B13, B2, C6, C1, C3

//input capture pin configuration
#define IC12RP()			PPS_IC1_TO_RPA2()			//ic1 pin: A2, B6, A4, B13, B2, C6, C1, C3
#define IC22RP()			PPS_IC2_TO_RPA3()			//ic2 pin: A3, B14, B0, B10, B9, C9, C2, C4
#define IC32RP()			PPS_IC3_TO_RPB8()			//ic3 pin: A1, B5, B1, B11, B8, A8, C8, A9
#define IC42RP()			PPS_IC4_TO_RPA0()			//ic4 pin: A0, B3, B4, B15, B7, C7, C0, C5
#define IC52RP()			PPS_IC5_TO_RPA2()			//ic5 pin: A2, B6, A4, B13, B2, C6, C1, C3

//extint pin configuration
//#define INT02RP()			PPS_INT1_TO_RPA3()			//int0 pin: fixed to rp7
#define INT12RP()			PPS_INT1_TO_RPA3()			//int0 pin: A3, B14, B0, B10, B9, C9, C2, C4
#define INT22RP()			PPS_INT2_TO_RPA2()			//int0 pin: A2, B6, A4, B13, B2, C6, C1, C3
#define INT32RP()			PPS_INT3_TO_RPA1()			//int0 pin: A1, B5, B1, B11, B8, A8, C8, A9
#define INT42RP()			PPS_INT4_TO_RPA0()			//int0 pin: A0, B3, B4, B15, B7, C7, C0, C5
//end pin configuration

//oscillator configuration
#define F_CPU				(F_FRC)			//cpu runs at 8Mhz/2 by default -> Fxtal = 8Mhz - can be updated by _F_CPU
#define F_XTAL				20000000ul		//crystal frequency, user-specified
#define F_SOSC				32768			//SOSC = 32768Hz, user-specified
//end user specification

#define F_FRC				8000000ul		//FRC frequency = 8Mhz, fixed
#define F_PHB				((F_CPU) >> (OSCCONbits.PBDIV))		//peripheral block runs at F_PB - default = F_CPU / 8

//port manipulation macros for PIC.
#define IO_SET(port, bits)              port |= (bits)			//set bits on port
#define IO_CLR(port, bits)              port &=~(bits)			//clear bits on port
#define IO_FLP(port, bits)              port ^= (bits)			//flip bits on port
#define IO_GET(port, bits)              ((port) & (bits))		//return bits on port
#define IO_OUT(ddr, bits)               ddr &=~(bits)			//set bits as output
#define IO_IN(ddr, bits)                ddr |= (bits)			//set bits as input

//if gpio_typedef is used
#define GIO_SET(port, bits)              port->LAT |= (bits)			//set bits on port
#define GIO_CLR(port, bits)              port->LAT &=~(bits)			//clear bits on port
#define GIO_FLP(port, bits)              port->LAT ^= (bits)			//flip bits on port
#define GIO_GET(port, bits)              ((port->PORT) & (bits))		//return bits on port
#define GIO_OUT(port, bits)              port->TRIS &=~(bits)			//set bits as output
#define GIO_IN(port, bits)               port->TRIS |= (bits)			//set bits as input

//fast port operations
#define FIO_SET(port, bits)              port->LATSET = (bits)			//set bits on port
#define FIO_CLR(port, bits)              port->LATCLR = (bits)			//clear bits on port
#define FIO_FLP(port, bits)              port->LATINV = (bits)			//flip bits on port
#define FIO_GET(port, bits)              ((port->PORT) & (bits))		//return bits on port
#define FIO_OUT(port, bits)              port->TRISCLR = (bits)			//set bits as output
#define FIO_IN(port, bits)               port->TRISSET = (bits)			//set bits as input

#define NOP()				Nop()                           //asm("nop")					//nop()
#define NOP2()				{NOP(); NOP();}
#define NOP4()				{NOP2(); NOP2();}
#define NOP8()				{NOP4(); NOP4();}
#define NOP16()				{NOP8(); NOP8();}
#define NOP16()				{NOP8(); NOP8();}
#define NOP24()				{NOP16(); NOP8();}
#define NOP32()				{NOP16(); NOP16();}
#define NOP40()				{NOP32(); NOP8();}
#define NOP64()				{NOP32(); NOP32();}

#define sleep()				asm("sleep")					//put the mcu into sleep

#ifndef ei
#define ei()				asm volatile ("ei")				//__builtin_enable_interrupts()	//do {INTEnableInterrupts();	INTEnableSystemMultiVectoredInt();} while (0)	//__builtin_enable_interrupts()
#endif

#ifndef di
#define di()				asm volatile ("di")				//__builtin_enable_interrupts()	//INTDisableInterrupts()			//__builtin_disable_interrupts()	//
#endif

//unlock sysLOCK
#define SYS_UNLOCK(){SYSKEY=0x0; SYSKEY=0xAA996655; SYSKEY=0x556699AA; }

