dannyf00/Another-Arduino-Clone/pic32duino.h
#define PPS_NC_TO_RPB3()		RPB3R = 0
#define PPS_U1TX_TO_RPB3()		RPB3R = 1
#define PPS_U2RTS_TO_RPB3()		RPB3R = 2
#define PPS_SS1_TO_RPB3()		RPB3R = 3
#define PPS_OC1_TO_RPB3()		RPB3R = 0b0101
#define PPS_C2OUT_TO_RPB3()		RPB3R = 0b0111

#define PPS_NC_TO_RPB4()		RPB4R = 0
#define PPS_U1TX_TO_RPB4()		RPB4R = 1
#define PPS_U2RTS_TO_RPB4()		RPB4R = 2
#define PPS_SS1_TO_RPB4()		RPB4R = 3
#define PPS_OC1_TO_RPB4()		RPB4R = 0b0101
#define PPS_C2OUT_TO_RPB4()		RPB4R = 0b0111

#define PPS_NC_TO_RPB15()		RPB15R = 0
#define PPS_U1TX_TO_RPB15()		RPB15R = 1
#define PPS_U2RTS_TO_RPB15()		RPB15R = 2
#define PPS_SS1_TO_RPB15()		RPB15R = 3
#define PPS_OC1_TO_RPB15()		RPB15R = 0b0101
#define PPS_C2OUT_TO_RPB15()		RPB15R = 0b0111

#define PPS_NC_TO_RPB7()		RPB7R = 0
#define PPS_U1TX_TO_RPB7()		RPB7R = 1
#define PPS_U2RTS_TO_RPB7()		RPB7R = 2
#define PPS_SS1_TO_RPB7()		RPB7R = 3
#define PPS_OC1_TO_RPB7()		RPB7R = 0b0101
#define PPS_C2OUT_TO_RPB7()		RPB7R = 0b0111

#define PPS_NC_TO_RPC7()		RPC7R = 0
#define PPS_U1TX_TO_RPC7()		RPC7R = 1
#define PPS_U2RTS_TO_RPC7()		RPC7R = 2
#define PPS_SS1_TO_RPC7()		RPC7R = 3
#define PPS_OC1_TO_RPC7()		RPC7R = 0b0101
#define PPS_C2OUT_TO_RPC7()		RPC7R = 0b0111

#define PPS_NC_TO_RPC0()		RPC0R = 0
#define PPS_U1TX_TO_RPC0()		RPC0R = 1
#define PPS_U2RTS_TO_RPC0()		RPC0R = 2
#define PPS_SS1_TO_RPC0()		RPC0R = 3
#define PPS_OC1_TO_RPC0()		RPC0R = 0b0101
#define PPS_C2OUT_TO_RPC0()		RPC0R = 0b0111

#define PPS_NC_TO_RPC5()		RPC5R = 0
#define PPS_U1TX_TO_RPC5()		RPC5R = 1
#define PPS_U2RTS_TO_RPC5()		RPC5R = 2
#define PPS_SS1_TO_RPC5()		RPC5R = 3
#define PPS_OC1_TO_RPC5()		RPC5R = 0b0101
#define PPS_C2OUT_TO_RPC5()		RPC5R = 0b0111


//group 2
#define PPS_NC_TO_RPA1()		RPA1R = 0
#define PPS_SDO1_TO_RPA1()		RPA1R = 0b0011
#define PPS_SDO2_TO_RPA1()		RPA1R = 0b0100
#define PPS_OC2_TO_RPA1()		RPA1R = 0b0101
#define PPS_C3OUT_TO_RPA1()		RPA1R = 0b0111

#define PPS_NC_TO_RPB5()		RPB5R = 0
#define PPS_SDO1_TO_RPB5()		RPB5R = 0b0011
#define PPS_SDO2_TO_RPB5()		RPB5R = 0b0100
#define PPS_OC2_TO_RPB5()		RPB5R = 0b0101
#define PPS_C3OUT_TO_RPB5()		RPB5R = 0b0111

#define PPS_NC_TO_RPB1()		RPB1R = 0
#define PPS_SDO1_TO_RPB1()		RPB1R = 0b0011
#define PPS_SDO2_TO_RPB1()		RPB1R = 0b0100
#define PPS_OC2_TO_RPB1()		RPB1R = 0b0101
#define PPS_C3OUT_TO_RPB1()		RPB1R = 0b0111

#define PPS_NC_TO_RPB11()		RPB11R = 0
#define PPS_SDO1_TO_RPB11()		RPB11R = 0b0011
#define PPS_SDO2_TO_RPB11()		RPB11R = 0b0100
#define PPS_OC2_TO_RPB11()		RPB11R = 0b0101
#define PPS_C3OUT_TO_RPB11()		RPB11R = 0b0111

#define PPS_NC_TO_RPB8()		RPB8R = 0
#define PPS_SDO1_TO_RPB8()		RPB8R = 0b0011
#define PPS_SDO2_TO_RPB8()		RPB8R = 0b0100
#define PPS_OC2_TO_RPB8()		RPB8R = 0b0101
#define PPS_C3OUT_TO_RPB8()		RPB8R = 0b0111

#define PPS_NC_TO_RPA8()		RPA8R = 0
#define PPS_SDO1_TO_RPA8()		RPA8R = 0b0011
#define PPS_SDO2_TO_RPA8()		RPA8R = 0b0100
#define PPS_OC2_TO_RPA8()		RPA8R = 0b0101
#define PPS_C3OUT_TO_RPA8()		RPA8R = 0b0111

#define PPS_NC_TO_RPC8()		RPC8R = 0
#define PPS_SDO1_TO_RPC8()		RPC8R = 0b0011
#define PPS_SDO2_TO_RPC8()		RPC8R = 0b0100
#define PPS_OC2_TO_RPC8()		RPC8R = 0b0101
#define PPS_C3OUT_TO_RPC8()		RPA1R = 0b0111

#define PPS_NC_TO_RPA9()		RPA9R = 0
#define PPS_SDO1_TO_RPA9()		RPA9R = 0b0011
#define PPS_SDO2_TO_RPA9()		RPA9R = 0b0100
#define PPS_OC2_TO_RPA9()		RPA9R = 0b0101
#define PPS_C3OUT_TO_RPA9()		RPA9R = 0b0111


//group 3
#define PPS_NC_TO_RPA2()		RPA2R = 0
#define PPS_SDO1_TO_RPA2()		RPA2R = 0b0011
#define PPS_SDO2_TO_RPA2()		RPA2R = 0b0100
#define PPS_OC4_TO_RPA2()		RPA2R = 0b0101
#define PPS_OC5_TO_RPA2()		RPA2R = 0b0110
#define PPS_REFCLKO_TO_RPA2()		RPA2R = 0b0111

#define PPS_NC_TO_RPB6()		RPB6R = 0
#define PPS_SDO1_TO_RPB6()		RPB6R = 0b0011
#define PPS_SDO2_TO_RPB6()		RPB6R = 0b0100
#define PPS_OC4_TO_RPB6()		RPB6R = 0b0101
#define PPS_OC5_TO_RPB6()		RPB6R = 0b0110
#define PPS_REFCLKO_TO_RPB6()		RPB6R = 0b0111

#define PPS_NC_TO_RPA4()		RPA4R = 0
#define PPS_SDO1_TO_RPA4()		RPA4R = 0b0011
#define PPS_SDO2_TO_RPA4()		RPA4R = 0b0100
#define PPS_OC4_TO_RPA4()		RPA4R = 0b0101
#define PPS_OC5_TO_RPA4()		RPA4R = 0b0110
#define PPS_REFCLKO_TO_RPA4()		RPA4R = 0b0111

#define PPS_NC_TO_RPB13()		RPB13R = 0
#define PPS_SDO1_TO_RPB13()		RPB13R = 0b0011
#define PPS_SDO2_TO_RPB13()		RPB13R = 0b0100
#define PPS_OC4_TO_RPB13()		RPB13R = 0b0101
#define PPS_OC5_TO_RPB13()		RPB13R = 0b0110
#define PPS_REFCLKO_TO_RPB13()	RPB13R = 0b0111

#define PPS_NC_TO_RPB2()		RPB2R = 0
#define PPS_SDO1_TO_RPB2()		RPB2R = 0b0011
#define PPS_SDO2_TO_RPB2()		RPB2R = 0b0100
#define PPS_OC4_TO_RPB2()		RPB2R = 0b0101
#define PPS_OC5_TO_RPB2()		RPB2R = 0b0110
#define PPS_REFCLKO_TO_RPB2()		RPB2R = 0b0111

#define PPS_NC_TO_RPC6()		RPC6R = 0
#define PPS_SDO1_TO_RPC6()		RPC6R = 0b0011
#define PPS_SDO2_TO_RPC6()		RPC6R = 0b0100
#define PPS_OC4_TO_RPC6()		RPC6R = 0b0101
#define PPS_OC5_TO_RPC6()		RPC6R = 0b0110
#define PPS_REFCLKO_TO_RPC6()		RPC6R = 0b0111

#define PPS_NC_TO_RPC1()		RPC1R = 0
#define PPS_SDO1_TO_RPC1()		RPC1R = 0b0011
#define PPS_SDO2_TO_RPC1()		RPC1R = 0b0100
#define PPS_OC4_TO_RPC1()		RPC1R = 0b0101
#define PPS_OC5_TO_RPC1()		RPC1R = 0b0110
#define PPS_REFCLKO_TO_RPC1()		RPC1R = 0b0111

#define PPS_NC_TO_RPC3()		RPC3R = 0
#define PPS_SDO1_TO_RPC3()		RPC3R = 0b0011
#define PPS_SDO2_TO_RPC3()		RPC3R = 0b0100
#define PPS_OC4_TO_RPC3()		RPC3R = 0b0101
#define PPS_OC5_TO_RPC3()		RPC3R = 0b0110
#define PPS_REFCLKO_TO_RPC3()		RPC3R = 0b0111

//group 4
#define PPS_NC_TO_RPA3()		RPA3R = 0
#define PPS_U1RTS_TO_RPA3()		RPA3R = 0b0001
#define PPS_U2TX_TO_RPA3()		RPA3R = 0b0010
#define PPS_SS2_TO_RPA3()		RPA3R = 0b0100
#define PPS_OC3_TO_RPA3()		RPA3R = 0b0101
#define PPS_C1OUT_TO_RPA3()		RPA3R = 0b0111

#define PPS_NC_TO_RPB14()		RPB14R = 0
#define PPS_U1RTS_TO_RPB14()	RPB14R = 0b0001
#define PPS_U2TX_TO_RPB14()		RPB14R = 0b0010
#define PPS_SS2_TO_RPB14()		RPB14R = 0b0100
#define PPS_OC3_TO_RPB14()		RPB14R = 0b0101
#define PPS_C1OUT_TO_RPB14()	RPB14R = 0b0111

#define PPS_NC_TO_RPB0()		RPB0R = 0
#define PPS_U1RTS_TO_RPB0()		RPB0R = 0b0001
#define PPS_U2TX_TO_RPB0()		RPB0R = 0b0010
#define PPS_SS2_TO_RPB0()		RPB0R = 0b0100
#define PPS_OC3_TO_RPB0()		RPB0R = 0b0101
#define PPS_C1OUT_TO_RPB0()		RPB0R = 0b0111

#define PPS_NC_TO_RPB10()		RPB10R = 0
#define PPS_U1RTS_TO_RPB10()	RPB10R = 0b0001
#define PPS_U2TX_TO_RPB10()		RPB10R = 0b0010
#define PPS_SS2_TO_RPB10()		RPB10R = 0b0100
#define PPS_OC3_TO_RPB10()		RPB10R = 0b0101
#define PPS_C1OUT_TO_RPB10()	RPB10R = 0b0111

#define PPS_NC_TO_RPB9()		RPB9R = 0
#define PPS_U1RTS_TO_RPB9()		RPB9R = 0b0001
#define PPS_U2TX_TO_RPB9()		RPB9R = 0b0010
#define PPS_SS2_TO_RPB9()		RPB9R = 0b0100
#define PPS_OC3_TO_RPB9()		RPB9R = 0b0101
#define PPS_C1OUT_TO_RPB9()		RPB9R = 0b0111

#define PPS_NC_TO_RPC9()		RPC9R = 0
#define PPS_U1RTS_TO_RPC9()		RPC9R = 0b0001
#define PPS_U2TX_TO_RPC9()		RPC9R = 0b0010
#define PPS_SS2_TO_RPC9()		RPC9R = 0b0100
#define PPS_OC3_TO_RPC9()		RPC9R = 0b0101
#define PPS_C1OUT_TO_RPC9()		RPC9R = 0b0111

#define PPS_NC_TO_RPC2()		RPC2R = 0
#define PPS_U1RTS_TO_RPC2()		RPC2R = 0b0001
#define PPS_U2TX_TO_RPC2()		RPC2R = 0b0010
#define PPS_SS2_TO_RPC2()		RPC2R = 0b0100
#define PPS_OC3_TO_RPC2()		RPC2R = 0b0101
#define PPS_C1OUT_TO_RPC2()		RPC2R = 0b0111

