dannyf00/Another-Arduino-Clone/pic32duino.h
#define PPS_NC_TO_RPC4()		RPC4R = 0
#define PPS_U1RTS_TO_RPC4()		RPC4R = 0b0001
#define PPS_U2TX_TO_RPC4()		RPC4R = 0b0010
#define PPS_SS2_TO_RPC4()		RPC4R = 0b0100
#define PPS_OC3_TO_RPC4()		RPC4R = 0b0101
#define PPS_C1OUT_TO_RPC4()		RPC4R = 0b0111

//simple multiples
#define x1(val)				(val)								//multiply val by 1
#define x2(val)				(((val) << 1))						//multiply val by 2
#define x3(val)				(x2(val) + (val))					//multiply val by 3
#define x4(val)				(((val) << 2))						//multiply val by 4
#define x5(val)				(x4(val) + (val))					//multiply val by 5
#define x6(val)				(x4(val) + x2(val))					//multiply val by 6
#define x7(val)				(x6(val) + (val))					//multiply val by 7
#define x8(val)				((val) << 3)						//multiply val by 8
#define x9(val)				(x8(val) + (val))					//multiply val by 9

//multiples of 10s
#define x10(val)			(x8(val) + x2(val))					//multiply val by 10
#define x100(val)			(x10(x10(val)))						//multiply val by 100
#define x1000(val)			(x100(x10(val)))					//multiply val by 1000
#define x1k(val)			x1000(val)							//multiply val by 1000
#define x10k(val)			(x100(x100(val)))					//multiply val by 10000

#define x20(val)			(x2(x10(val)))
#define x30(val)			(x3(x10(val)))
#define x40(val)			(x4(x10(val)))
#define x50(val)			(x5(x10(val)))
#define x60(val)			(x6(x10(val)))
#define x70(val)			(x7(x10(val)))
#define x80(val)			(x8(x10(val)))
#define x90(val)			(x9(x10(val)))

//multiples of 100s
#define x200(val)			(x2(x100(val)))
#define x300(val)			(x3(x100(val)))
#define x400(val)			(x4(x100(val)))
#define x500(val)			(x5(x100(val)))
#define x600(val)			(x6(x100(val)))
#define x700(val)			(x7(x100(val)))
#define x800(val)			(x8(x100(val)))
#define x900(val)			(x9(x100(val)))

//custom definitions
#define x34(val)			(x30(val) + x4(val))				//multiply val by 34
#define x97(val)			(x90(val) + x7(val))				//multiply val by 97x

//port structure
typedef struct {
    volatile uint32_t ANSEL;			//analog select
    volatile uint32_t ANSELCLR;        	//set to clear
    volatile uint32_t ANSELSET;        	//set to set
    volatile uint32_t ANSELINV;        	//set to flip

    volatile uint32_t TRIS;             //data direction register -> 0ffset 0x0000, little endian
    //volatile uint32_t RESERVED0[3];   //fill the space
    volatile uint32_t TRISCLR;          //set to clear
    volatile uint32_t TRISSET;          //set to set
    volatile uint32_t TRISINV;          //set to flip
    
    volatile uint32_t PORT;             //input data register
    volatile uint32_t RESERVED1[3];     //fill the space
    
    volatile uint32_t LAT;              //output data register
    //volatile uint32_t RESERVED2[3];   //fill the space
    volatile uint32_t LATCLR;          	//set to clear
    volatile uint32_t LATSET;          	//set to set
    volatile uint32_t LATINV;          	//set to flip
    
    volatile uint32_t ODC;              //open drain configuration register. set to activate open drain
    volatile uint32_t RESERVED3[3];     //fill the space
    
    volatile uint32_t CNPU;				//change notification weak pull-up
    //volatile uint32_t RESERVED4[3];   //fill the space
    volatile uint32_t CNPUCLR;          //set to clear
    volatile uint32_t CNPUSET;          //set to set
    volatile uint32_t CNPUINV;          //set to flip
    
    volatile uint32_t CNPD;				//change notification weak pull-down
    //volatile uint32_t RESERVED5[3];   //fill the space
    volatile uint32_t CNPDCLR;          //set to clear
    volatile uint32_t CNPDSET;          //set to set
    volatile uint32_t CNPDINV;          //set to flip
    
    volatile uint32_t CNCON;			//change notification control register (1<<15 to enable, 0<<15 to disable)
    volatile uint32_t RESERVED6[3];     //fill the space
    
    volatile uint32_t CNEN;				//change notification enable register (1->enable, 0->disable)
    //volatile uint32_t RESERVED7[3];   //fill the space
    volatile uint32_t CNENCLR;          //set to clear
    volatile uint32_t CNENSET;          //set to set
    volatile uint32_t CNENINV;          //set to flip
    
    volatile uint32_t CNSTAT;			//change notification status register (1->changed, 0->not changed)
    volatile uint32_t RESERVED8[3];     //fill the space

} GPIO_TypeDef;                         //port definition registers

#define GPIOA                           ((GPIO_TypeDef *) &ANSELA)
#define GPIOB                           ((GPIO_TypeDef *) &ANSELB)
#define GPIOC                           ((GPIO_TypeDef *) &ANSELC)
#define GPIOD                           ((GPIO_TypeDef *) &ANSELD)
#define GPIOE                           ((GPIO_TypeDef *) &ANSELE)
#define GPIOF                           ((GPIO_TypeDef *) &ANSELF)
#define GPIOG                           ((GPIO_TypeDef *) &ANSELG)

//pre-requisite: FCKSM = CSECMD.
//NOSC bits 10..8
#define CLKNOSC_FRCDIV		(0b111 << 8)	//clock source = frc/
#define CLKNOSC_FRC16		(0b110 << 8)	//clock source = frc/16
#define CLKNOSC_LPRC		(0b101 << 8)	//clock source = lprc
#define CLKNOSC_SOSC		(0b100 << 8)	//clock source = sosc
#define CLKNOSC_POSCPLL		(0b011 << 8)	//clock source = hs, xt, ec + PLL
#define CLKNOSC_POSC		(0b010 << 8)	//clock source = hs, xt, ec
#define CLKNOSC_FRCPLL		(0b001 << 8)	//clock source = frc + PLL
#define CLKNOSC_FRC			(0b000 << 8)	//clock source = frc

//COSC bits 14..12
#define CLKCOSC_FRCDIV		(0b111 << 12)	//clock source = frc/
#define CLKCOSC_FRC16		(0b110 << 12)	//clock source = frc/16
#define CLKCOSC_LPRC		(0b101 << 12)	//clock source = lprc
#define CLKCOSC_SOSC		(0b100 << 12)	//clock source = sosc
#define CLKCOSC_POSCPLL		(0b011 << 12)	//clock source = hs, xt, ec + PLL
#define CLKCOSC_POSC		(0b010 << 12)	//clock source = hs, xt, ec
#define CLKCOSC_FRCPLL		(0b001 << 12)	//clock source = frc + PLL
#define CLKCOSC_FRC			(0b000 << 12)	//clock source = frc

//CLK FRCDIV bit 26..24
#define CLKFRCDIV_256		(0b111 << 24)	//frc divider = 256
#define CLKFRCDIV_64		(0b110 << 24)	//frc divider = 64
#define CLKFRCDIV_32		(0b101 << 24)	//frc divider = 32
#define CLKFRCDIV_16		(0b100 << 24)	//frc divider = 16
#define CLKFRCDIV_8			(0b011 << 24)	//frc divider = 8
#define CLKFRCDIV_4			(0b010 << 24)	//frc divider = 4
#define CLKFRCDIV_2			(0b001 << 24)	//frc divider = 2
#define CLKFRCDIV_1			(0b000 << 24)	//frc divider = 1

