dannyf00/Another-Arduino-Clone/pic32duino.h
//reset the mcu
void mcu_init(void);

//empty interrupt handler
void empty_handler(void);


//#define Mhz					000000ul	//suffix for Mhz
#define F_UART				(F_PHB)	//8Mhz		//crystal frequency
#define UART_BR300			300ul		//buadrate=300
#define UART_BR600			600ul		//buadrate=600
#define UART_BR1200			1200ul		//buadrate=1200
#define UART_BR2400			2400ul		//buadrate=2400
#define UART_BR4800			4800ul		//buadrate=4800
#define UART_BR9600			9600ul		//buadrate=9600
#define UART_BR19200		19200ul		//buadrate=19200
#define UART_BR38400		38400ul		//buadrate=38400
#define UART_BR57600		57600ul		//buadrate=57600
#define UART_BR115200		115200ul	//buadrate=115200

//for compatability
#define uart1Put(ch)		uart1Putch(ch)
#define uart1Get()			uart1Getch()

//initiate the hardware usart
void uart1Init(unsigned long baud_rate);

void uart1Putch(char ch);

void uart1Puts(char *str);

/*

Writes a line of text to USART and goes to new line
The new line is Windows style CR/LF pair.

This will work on Hyper Terminal Only NOT on Linux

*/

void uart1Putline(char *ln);

//read a char from usart
uint8_t uart1Getch(void);

//test if data rx is available
uint16_t uart1Available(void);
//test if uart tx is busy
uint16_t uart1Busy(void);

//for compatability
#define uart2Put(ch)		uart2Putch(ch)
#define uart2Get()			uart2Getch()

//initiate the hardware usart
void uart2Init(unsigned long baud_rate);

void uart2Putch(char ch);

void uart2Puts(char *str);

/*

Writes a line of text to USART and goes to new line
The new line is Windows style CR/LF pair.

This will work on Hyper Terminal Only NOT on Linux

*/

void uart2Putline(char *ln);

//read a char from usart
uint8_t uart2Getch(void);

//test if data rx is available
uint16_t uart2Available(void);
//test if uart tx is busy
uint16_t uart2Busy(void);
//end Serial

//tmr1 prescaler
#define TMR1_PS1x			0x00
#define TMR1_PS8x			0x01
#define TMR1_PS64x			0x02
#define TMR1_PS256x			0x03
#define TMR1_PSMASK			TMR1_PS256x

//tmr2-5 prescaler
#define TMR_PS1x			0x00
#define TMR_PS2x			0x01
#define TMR_PS4x			0x02
#define TMR_PS8x			0x03
#define TMR_PS16x			0x04
#define TMR_PS32x			0x05
#define TMR_PS64x			0x06
#define TMR_PS256x			0x07
#define TMR_PSMASK			TMR_PS256x

#define TMR_IPDEFAULT		2
#define TMR_ISDEFAULT		0

//initialize the timer1 (16bit)
void tmr1Init(uint8_t ps, uint16_t period);
//activate the isr handler
void tmr1AttachISR(void (*isrptr)(void));

//initialize the timer2 (16bit)
void tmr2Init(uint8_t ps, uint16_t period);
//activate the isr handler
void tmr2AttachISR(void (*isrptr)(void));

//initialize the timer3 (16bit)
void tmr3Init(uint8_t ps, uint16_t period);
//activate the isr handler
void tmr3AttachISR(void (*isrptr)(void));

//initialize the timer4 (16bit)
void tmr4Init(uint8_t ps, uint16_t period);
//activate the isr handler
void tmr4AttachISR(void (*isrptr)(void));

//initialize the timer5 (16bit)
void tmr5Init(uint8_t ps, uint16_t period);
//activate the isr handler
void tmr5AttachISR(void (*isrptr)(void));

//pwm / oc
//initialize pwm1
void pwm1Init(void);
#define pwm1SetDC(dc)			do {OC1RS = (dc);} while (0)
#define pwm1GetDC()				(OC1RS)

//initialize pwm2
void pwm2Init(void);
#define pwm2SetDC(dc)			do {OC2RS = (dc);} while (0)
#define pwm2GetDC()				(OC2RS)

//initialize pwm3
void pwm3Init(void);
#define pwm3SetDC(dc)			do {OC3RS = (dc);} while (0)
#define pwm3GetDC()				(OC3RS)

//initialize pwm4
void pwm4Init(void);
#define pwm4SetDC(dc)			do {OC4RS = (dc);} while (0)
#define pwm4GetDC()				(OC4RS)

//initialize pwm5
void pwm5Init(void);
#define pwm5SetDC(dc)			do {OC5RS = (dc);} while (0)
#define pwm5GetDC()				(OC5RS)

//adc
//adc channels
#define ADC_AN0						0			//AN0 / RA0
#define ADC_AN1						1			//AN1 / RA1
#define ADC_AN2						2			//AN2 / RB0
#define ADC_AN3						3			//AN3 / RB1
#define ADC_AN4						4			//AN4 / RB2
#define ADC_AN5						5			//AN5 / RB3
#define ADC_AN6						6			//AN6 / RC0
#define ADC_AN7						7			//AN7 / RC1
#define ADC_AN8						8			//AN8 / RC2
#define ADC_AN9						9			//AN9 / RB15
#define ADC_AN10					10			//AN10/ RB14
#define ADC_AN11					11			//AN11/ RB13
#define ADC_AN12					12			//AN12/ RB12
#define ADC_AN13					13			//CTMUT
#define ADC_AN14					14			//internal reference IVref
#define ADC_AN15					15			//Open

//rest the adc
//automatic sampling (ASAM=1), manual conversion
void adcInit(void);

//read the adc
uint16_t analogRead(uint16_t ch);
//end ADC

//input capture

#define IC_IPDEFAULT		1
#define IC_ISDEFAULT		0

//16-bit mode, rising edge, single capture, Timer2 as timebase
//interrupt disabled
void ic1Init(void);
void ic1AttachISR(void (*isrptr)(void));		//activate user ptr
uint16_t ic1Get(void);							//read buffer value

void ic2Init(void);
void ic2AttachISR(void (*isrptr)(void));		//activate user ptr
uint16_t ic2Get(void);							//read buffer value

void ic3Init(void);
void ic3AttachISR(void (*isrptr)(void));		//activate user ptr
uint16_t ic3Get(void);							//read buffer value

void ic4Init(void);
void ic4AttachISR(void (*isrptr)(void));		//activate user ptr
uint16_t ic4Get(void);							//read buffer value

void ic5Init(void);
void ic5AttachISR(void (*isrptr)(void));		//activate user ptr
uint16_t ic5Get(void);							//read buffer value
//end input capture

//extint
#define INT_IPDEFAULT		6
#define INT_ISDEFAULT		0

void int0Init(void);							//initialize the module
void int0AttachISR(void (*isrptr) (void));		//attach user isr

void int1Init(void);							//initialize the module
void int1AttachISR(void (*isrptr) (void));		//attach user isr

void int2Init(void);							//initialize the module
void int2AttachISR(void (*isrptr) (void));		//attach user isr

void int3Init(void);							//initialize the module
void int3AttachISR(void (*isrptr) (void));		//attach user isr

void int4Init(void);							//initialize the module
void int4AttachISR(void (*isrptr) (void));		//attach user isr
//end extint

//spi

void spi1Init(uint16_t br);						//reset the spi
void spi1Write(uint8_t dat);					//send data via spi
#define spi1Busy()			(SPI1STATbits.SPITBF)	//transmit buffer full, must wait before writing to SPIxBUF
#define spi1Available()		(!SPI1STATbits.SPIRBE)	//receive buffer not empty -> there is data
#define spi1Read()			(SPI1BUF)			//read from the buffer

void spi2Init(uint16_t br);						//reset the spi
void spi2Write(uint8_t dat);					//send data via spi
#define spi2Busy()			(SPI2STATbits.SPITBF)	//transmit buffer full, must wait before writing to SPIxBUF
#define spi2Available()		(!SPI2STATbits.SPIRBE)	//receive buffer not empty -> there is data
#define spi2Read()			(SPI2BUF)			//read from the buffer

//end spi

//i2c
//end i2c

//rtcc

void rtccInit(void);							//initialize the rtcc
#define rtccGetTime()		(RTCTIME)			//get rtc time
uint32_t rtccSetTime(uint32_t val);				//set time
#define rtccGetDate()		(RTCDATE)			//get rtc date
uint32_t rtccSetDate(uint32_t val);				//set date
uint32_t rtccSetCal(uint32_t offset);			//set calibration
uint32_t rtccGetCal(void);						//read the calibration
//end rtcc

//cnint
#define CN_IPDEFAULT		1
#define CN_ISDEFAULT		0

void cnaInit(uint16_t pins);					//initialize change notification
void cnaAttachISR(void (*isrptr) (void));		//attach user isr
void cnbInit(uint16_t pins);					//initialize change notification
void cnbAttachISR(void (*isrptr) (void));		//attach user isr
#if defined(_PORTC)
void cncInit(uint16_t pins);					//initialize change notification
void cncAttachISR(void (*isrptr) (void));		//attach user isr
#endif		//_PORTC
//end cnint

#endif
